ryandrake08/billy/firmware/sdkconfig.defaults
# Target: ESP32-S3-WROOM-1 N8R8 (8 MB flash, 8 MB PSRAM). `idf.py set-target esp32s3` applies
# the target; this pins it too.
CONFIG_IDF_TARGET="esp32s3"

# 8 MB flash — the N8R8's actual size. The default 2 MB tripped a size-mismatch warning at boot
# and left the app cramped in a 1 MB partition. The custom table (partitions.csv) gives the app
# room to grow. (PSRAM stays off until audio buffering needs it.)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (N8R8 = 8 MB octal) — needed to buffer captured utterances and TTS audio, which are too
# large for the ~290 KB of internal DRAM left after WiFi. heap_caps_malloc(MALLOC_CAP_SPIRAM).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
